SaraEye/SaraKIT-dsPIC33-bldc-gimbal-motor/main.c
/**
  Generated main.c file from MPLAB Code Configurator

  @Company
    Microchip Technology Inc.

  @File Name
    main.c

  @Summary
    This is the generated main.c using PIC24 / dsPIC33 / PIC32MM MCUs.

  @Description
    This source file provides main entry point for system initialization and application code development.
    Generation Information :
        Product Revision  :  PIC24 / dsPIC33 / PIC32MM MCUs - 1.170.0
        Device            :  dsPIC33CK32MP503
    The generated drivers are tested against the following:
        Compiler          :  XC16 v1.61
        MPLAB 	          :  MPLAB X v5.50
*/

/*
    (c) 2020 Microchip Technology Inc. and its subsidiaries. You may use this
    software and any derivatives exclusively with Microchip products.

    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
    WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
    PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION
    WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.

    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
    BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE
    FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN
    ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
    THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.

    MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE
    TERMS.
*/

//raspi-gpio set 17 ip pn //(before PIC programming)

/**
  Section: Included Files
 */
#include <stdio.h>
#include <string.h>

#include "mcc_generated_files/system.h"
#include "mcc_generated_files/i2c1.h"
#include "mcc_generated_files/pin_manager.h"
#include "mcc_generated_files/tmr1.h"
#include "mcc_generated_files/pwm.h"
#include "mcc_generated_files/spi1.h"
#include "mcc_generated_files/sccp1_tmr.h"
#include "mcc_generated_files/interrupt_manager.h"
#include <p33CK32MP503.h>
#include "dsp.h"
/*
                         Main application
 */
#define ACC_I2C_ADDRESS ((uint8_t)0b0011001)
/*
 *  rxbuf[0]:
 *      b7-b4: typ wiadomo?ci:
 *          0000 - set the absolute position (0-3600, i.e. in degrees/10, i.e. with the accuracy to 1/10 of a degree) (position, direction and speed)
 *          0001 - set the absolute position with automatic direction (0-3600, i.e. in degrees/10, i.e. with the accuracy to 1/10 of a degree) (position and speed)
 *          0010 - ustaw pozycje wzgledna (-3600 do 3600, dokladnosc 1/10 stopnia) (pozycja,kierunek i szybkosc)
 *          0011 - ruch ciagly (szybkosc,kierunek)
 *          0100 - ustaw moc silnika w ruchu (0-100)
 *          0101 - ustaw moc i czas utrzymania mocy po ruchu (w spoczynku)
 *          0110 - zatrzymaj silnik
 *          0111 - pobierz i odeslij info
 *          1000 - reboot device - go to bootloader
 *          1001 - odczyt danych z akcelerometru
 *          1010 - zmien domyslny czas przerwania dla regulacji predkosci dzielnikiem
 *          1011 - ustaw liczbe par magnesow 7 dla 12N14P lub 11 dla 24N22P
 * 
 *              0 b3: kierunek '+', 1 - kierunek '-' dojscia do zadanego kata
 *               000 b2-b0: numer silnika (8 silników)
 * 
 *  rxbuf[1]:
 *      dla 0000:   b7-b4: pozycja MSB
 *                  b3-b0: szybkosc MSB
 *      dla 0001:   b7-b4: pozycja MSB
 *                  b3-b0: szybkosc MSB
 *      dla 0010:   b7-b4: pozycja MSB
 *                  b3-b0: szybkosc MSB
 *      dla 0011:   b7-b4: nie uzywane
 *                  b3-b0: szybkosc MSB
 *      dla 0100:   b7-b0: moc silnika 0-100
 *      dla 0101:   b7-b0: moc silnika w spoczynku 0-100
 *      dla 0110:   nie uzywane
 *      dla 1000:   0 - electrical position
 *                  1 - aktualneTorque
 *                  2 - lastMotionTime - odczyt czasu od ostatniego ruchu silników
 *                  3 - motor encoder (PWM)
 *      dla 1001:   nie uzywane 
 *      dla 1010: 
 *      dla 1011:   liczba par magnesow
 *      
 *  rxbuf[2]:
 *      dla 0000:   b7-b0: pozycja LSB (razem 4095, ale uzywamy stopni wiec 3600, czyli 360,0 czyli stopnie do 1/10 stopnia dokladnosci)
 *      dla 0001:   b7-b0: pozycja LSB (razem 4095, ale uzywamy stopni wiec 3600, czyli 360,0 czyli stopnie do 1/10 stopnia dokladnosci)
 *      dla 0010:   b7-b0: pozycja LSB (razem 4095, ale uzywamy stopni wiec 3600, czyli 360,0 czyli stopnie do 1/10 stopnia dokladnosci)
 *      dla 0011:   nie uzywane                
 *      dla 0100:   nie uzywane
 *      dla 0101:   b7-b0: czas IdleTime LSB 0-65535ms
 *      dla 0110:   nie uzywane
 *      dla 1000:   nie uzywane
 *      dla 1001:   nie uzywane 
 *      dla 1010: 
 *      dla 1011:   nie uzywane 
 * 
 *  rxbuf[3]:
 *      dla 0000:   b7-b0: szybkosc LSB (razem 4095, gdzie 4095=100...
 *      dla 0001:   b7-b0: szybkosc LSB (razem 4095, gdzie 4095=100...
 *      dla 0010:   b7-b0: szybkosc LSB (razem 4095, gdzie 4095=100...
 *      dla 0011:   b7-b0: szybkosc LSB (razem 4095, gdzie 4095=100...
 *      dla 0100:   nie uzywane
 *      dla 0101:   b7-b0: czas IdleTime MSB 0-65535ms
 *      dla 0110:   nie uzywane
 *      dla 1000:   nie uzywane
 *      dla 1001:   nie uzywane 
 *      dla 1010: 
 *      dla 1011:   nie uzywane 
 *  
*/


volatile uint8_t i2cBufferTX[8] = {0};
volatile uint8_t i2cBufferRX[8] = {0};
volatile I2C1_MESSAGE_STATUS i2c_status;

volatile uint16_t rxbuf[4] = {0}; //bufor SPI

bool accReadEnable = false;
volatile uint8_t accBuffer[6] = {0};

volatile float currentPositionA = 0, currentPositionB = 0; //obecna pozycja silnikow (7x360)/2 => -1260-0-1260
volatile float targetPositionA = 0, targetPositionB = 0; //zmiena do zadawania nowej pozycji silnika -1260-0-1260
volatile float electricalPositionA = 0, electricalPositionB = 0; //obecna pozycja w tablicy generujacej kolowe pole magnetyczne 0-360
volatile int16_t breakingZoneA = 100, breakingZoneB = 100; //strefa hamowania 0-500 
volatile int16_t StartA = 0, StartB = 0; //startuje, wi?c pozycja gdy ruch np. 360 stopni nie zako?czony lecz wystartowa? 
volatile float SpeedA = 0.5, SpeedB = 0.5; //pr?dko?? maksymalna 0.01-10 
volatile int16_t PolePairsA = 12, PolePairsB = 12; //6 dla 12N14P lub 12 dla 24N22P
volatile uint8_t lastMotionA=0, lastMotionB=0; //jak dawno ostatni ruch, zero gdy nadal trwa
volatile float lastSpeedA=0,lastSpeedB=0;
volatile bool newData = false;
volatile float torqueA = 0.0f, torqueB = 0.0f; //obecny moment silnikow
volatile float idleTorqueA = 0.0f, idleTorqueB = 0.0f;
volatile float curTorqueA = 0.0f, curTorqueB =0.0f;
volatile uint16_t keepTorqueTimeA = 300, keepTorqueTimeB = 300;
volatile uint8_t MoveContinuousA=0, MoveContinuousB=0;//ruch ci?g?y =1
volatile float dirA=1, dirB=1;//kierunek ruchu
volatile uint16_t defaultTimerPeriod = 0x1869; //0x30D2 2ms, 0x1869 1ms, 0x0C34 0.5ms, 0x61a 0.25ms, 0x2a 0.01ms, 0xcd 0.034ms
volatile float motor_table[1806]; //360/7=51.42857*5= minimum 7 pair pols - dok?adno?? co 0.2 stopnia

