SaraEye/SaraKIT-dsPIC33-bldc-gimbal-motor/main.c
static void Reset(void){
    asm ("reset");
}

void SCCP1_TMR_Timer32CallBack(){
    if (!accReadEnable){
        return;
    }
    memcpy((uint8_t*) accBuffer, (uint8_t*) i2cBufferRX, sizeof (accBuffer));
    i2cBufferTX[0] = 0x28 + 0x80; //0x80 - address auto increment
    I2C1_MasterWrite((uint8_t*) i2cBufferTX, 1, ACC_I2C_ADDRESS, (I2C1_MESSAGE_STATUS*) & i2c_status);
    I2C1_MasterRead((uint8_t*) i2cBufferRX, 6, ACC_I2C_ADDRESS, (I2C1_MESSAGE_STATUS*) & i2c_status);
}

float absf(float v) {
    if (v>=0)
        return v;
    else
        return -v;
}

float diffAngle(float anglecur, float angledest, uint8_t dir) {
    if (dir==1){
        if (angledest>anglecur)
            return angledest-anglecur;
        else
            return 360-(anglecur-angledest);
    } else {
        if (angledest<anglecur)
            return anglecur-angledest;
        else
            return 360-(angledest-anglecur);
    }        
}

float checkAngle(float angle) {    
    while (angle>=360) {
        angle=(angle-360);
    }
    while (angle<0) {
        angle=(angle+360);
    }
    return angle;
}

float computeVoltageVector(float rotorPosition)
{
    float theta_elec_degrees = ((rotorPosition) + 90 ); // 11 - pole pairs (22P). + 90 because at initial position theta = 90
    float theta = theta_elec_degrees*PI/180.0;//Pi/180; // translating into radians
    return cosf(theta);//cos(theta);
}

int16_t GetPWM_DutyCycle(float electricalPosition, float vectorAmplitude, int16_t PolePairs, int16_t f)
{        
    float ang1=(360.0/(float)PolePairs);
    float ang2=electricalPosition;
    while (ang2>=ang1)
        ang2=ang2-ang1;
    float ang3=(ang2*360.0)/ang1;

    float v;
    if (f==0)
        v=((motor_table[(int16_t)(ang3*5)] * vectorAmplitude)/2)+31246;
    else if (f==1)
        v=((motor_table[(int16_t)(checkAngle(ang3-120)*5)] * vectorAmplitude)/2)+31246;
    else
        v=((motor_table[(int16_t)(checkAngle(ang3+120)*5)] * vectorAmplitude)/2)+31246;

    return (int16_t)v;
}
/*
    Funkcja wywolywana co np. 0.5 ms.
    Czestotliwosc mozna dostosowac przez lub przez CodeConfigurator timera lub recznie w pliku tmr1.c
*/
void timer_interrupt(void){    
    static int16_t time_counterA = 0, time_counterB = 0; //liczniki czasu
    static float diffA = 0, diffB =0;
   
    breakingZoneA=(SpeedA*100);
    breakingZoneB=(SpeedB*100);       
    
//==============Driver A (Poziomy)    
    if(MoveContinuousA){
        currentPositionA=checkAngle(currentPositionA+SpeedA*dirA);
        electricalPositionA=currentPositionA;
        lastMotionA=0;                
        curTorqueA=torqueA;
    } else {
        if (currentPositionA==targetPositionA && StartA==0) {
            if(lastMotionA<255)
                lastMotionA++;
            if (time_counterA > 0) {
                //jest w pozycji target ale nie odpuszczaj momentu obrotowego przez jakis czas po zakonczeniu ruchu
                time_counterA--;
            } else { //daj moment na spoczynkowy
                curTorqueA = idleTorqueA;
            }
        } else {
            StartA=0;
            time_counterA = keepTorqueTimeA; //zadaj opoznienie po jakim zostanie zmniejszony moment trzymajacy silnika

            float spd=0;
            float step=0;
            diffA=diffAngle(currentPositionA,targetPositionA,dirA);
            if (diffA<=breakingZoneA){
                spd=SpeedA/(breakingZoneA/diffA+1);
                if(diffA>spd)
                    step=spd;
            }else 
            if (lastSpeedA<SpeedA){
                spd=lastSpeedA+(SpeedA/breakingZoneA);
                if(diffA>spd)
                    step=spd;
            }else{
                spd=SpeedA;
                if(abs(diffA)>spd){
                    step=spd;
                }
                else{
                    step=diffA;
                }
            } 
            lastSpeedA=spd;
                
            currentPositionA=checkAngle(currentPositionA+step*dirA);
            if (diffAngle(currentPositionA,targetPositionA,dirA)<0.03)
                currentPositionA=targetPositionA;

            curTorqueA=torqueA;
            electricalPositionA=currentPositionA;
            lastMotionA=0;        
        }
    }
    /*
    Zadanie sygnalow do modulu PWM
    Modul jest skonfigurowanie do przyjmowania wartosci z zakresu 0-62492
    W ustawieniach peryferium PWM mozna modyfikowac powyzsza wartosc.
    Zwi?kszenie rozdzielczosci zmniejsza czestotliwosc pracy i na odwrot.
    Zmian mozna dokonac recznie w pwm.c lub przez CodeConfigurator
    */    
    float vectorAmplitudeA = 6200*curTorqueA;
    PWM_DutyCycleSet(PWM_GENERATOR_6, GetPWM_DutyCycle(electricalPositionA,vectorAmplitudeA,PolePairsA,0));
    PWM_DutyCycleSet(PWM_GENERATOR_5, GetPWM_DutyCycle(electricalPositionA,vectorAmplitudeA,PolePairsA,1));
    PWM_DutyCycleSet(PWM_GENERATOR_3, GetPWM_DutyCycle(electricalPositionA,vectorAmplitudeA,PolePairsA,2));

//==============Driver B (Pionowy)
    if(MoveContinuousB){
        currentPositionB=checkAngle(currentPositionB+SpeedB*dirB);
        electricalPositionB=currentPositionB;
        lastMotionB=0;                
        curTorqueB=torqueB;
    } else {
        if (currentPositionB==targetPositionB && StartB==0) {
            if(lastMotionB<255)
                lastMotionB++;
            if (time_counterB > 0) {
                //jest w pozycji target ale nie odpuszczaj momentu obrotowego przez jakis czas po zakonczeniu ruchu
                time_counterB--;
            } else { //daj moment na spoczynkowy
                curTorqueB = idleTorqueB;
            }
        } else {
            StartB=0;
            time_counterB = keepTorqueTimeB; //zadaj opoznienie po jakim zostanie zmniejszony moment trzymajacy silnika

            float spd=0;
            float step=0;
            diffB=diffAngle(currentPositionB,targetPositionB,dirB);
            if (diffB<=breakingZoneB){
                spd=SpeedB/(breakingZoneB/diffB+1);
                if(diffB>spd)
                    step=spd;
            }else 
            if (lastSpeedB<SpeedB){
                spd=lastSpeedB+(SpeedB/breakingZoneB);
                if(diffB>spd)
                    step=spd;
            }else{
                spd=SpeedB;
                if(abs(diffB)>spd){
                    step=spd;
                }
                else{
                    step=diffB;
                }
            } 
            lastSpeedB=spd;

