SaraEye/SaraKIT-dsPIC33-bldc-gimbal-motor/main.c
            currentPositionB=checkAngle(currentPositionB+step*dirB);
            if (diffAngle(currentPositionB,targetPositionB,dirB)<0.03)
                currentPositionB=targetPositionB;

            curTorqueB=torqueB;
            electricalPositionB=currentPositionB;
            lastMotionB=0;        
        }
    }
    float vectorAmplitudeB = 6200*curTorqueB;
    PWM_DutyCycleSet(PWM_GENERATOR_2, GetPWM_DutyCycle(electricalPositionB,vectorAmplitudeB,PolePairsB,0));
    PWM_DutyCycleSet(PWM_GENERATOR_1, GetPWM_DutyCycle(electricalPositionB,vectorAmplitudeB,PolePairsB,1));
    PWM_DutyCycleSet(PWM_GENERATOR_4, GetPWM_DutyCycle(electricalPositionB,vectorAmplitudeB,PolePairsB,2));
}

/*
    Przerwanie peryferium SPI1. Odczytuje dane z bufora do tablicy.
    Domyslny rozmiar ramki to 4 bajty.
*/
void __attribute__ ( ( interrupt, no_auto_psv ) ) _SPI1RXInterrupt () {
//    uint16_t w=0;
//    while ( SPI1STATLbits.SPIRBE == true||++w<9999)
//    {}
    rxbuf[3] = 0xFF & SPI1BUFL;
    rxbuf[2] = 0xFF & (SPI1BUFL >> 8);
    rxbuf[1] = 0xFF & SPI1BUFH;
    rxbuf[0] = 0xFF & (SPI1BUFH >> 8);
    newData = true;
    IFS0bits.SPI1RXIF = false;
}
void spiBufReset(){
    SPI1BUFL=0;
    SPI1BUFH=0;
}

void parseMotorTimerPeriod() {
    defaultTimerPeriod = (uint16_t) rxbuf[1] << 8 | rxbuf[2]; //todo - sprawdzic czy dziala
//    if (rxbuf[3] & 0x80) {
//        /*
//         * rxbuf[3] == 128 odpowiada czasowi przerwania ok 62,5us
//         * rxbuf[3] == 128 + 8 odpowiada czasowi przerwania ok 0,5ms
//         * rxbuf[3] == 128 + 19 odpowiada czasowi przerwania ok 1ms
//         * rxbuf[3] == 128 + 100 odpowiada czasowi przerwania ok 5ms
//         *///
//        uint16_t timerPeriod = rxbuf[3] & 0x7F;
//        timerPeriod = (timerPeriod * 0x134) + 0x186;
//        TMR1_Period16BitSet(timerPeriod);
//    } else {
        TMR1_Period16BitSet(defaultTimerPeriod);
//    }   
}

void parseMotorMoveTorque() {
    float tmpTrq=0;
    if (rxbuf[0] & 0b00000001) { //todo silniki nie tylko 2 ale 8 max
        //sterowanie silnikiem B
        tmpTrq = (float) (rxbuf[1]);
        if(tmpTrq>100)
            tmpTrq=100;
        torqueB=tmpTrq/10;
    } else {
        tmpTrq = (float) (rxbuf[1]);
        if(tmpTrq>100)
            tmpTrq=100;
        torqueA=tmpTrq/10;
    }
}

void parseMotorIdleTorque() {
    float tmpTrq=0;
    if (rxbuf[0] & 0b00000001) { //todo silniki nie tylko 2 ale 8 max
        //sterowanie silnikiem B  
        tmpTrq = (float) (rxbuf[1]);
        if(tmpTrq>100)
            tmpTrq=100;
        idleTorqueB=tmpTrq/10;
        keepTorqueTimeB = (((uint16_t) (rxbuf[2]) << 8) | rxbuf[3]);
    } else {
        //sterowanie silnikiem A
        tmpTrq = (float) (rxbuf[1]);
        if(tmpTrq>100)
            tmpTrq=100;
        idleTorqueA=tmpTrq/10;
        keepTorqueTimeA = (((uint16_t) (rxbuf[2]) << 8) | rxbuf[3]);
    }   
}

void parseMotorMoveToAngle(bool autoCalcDir) {
    float tp=(uint16_t) (((rxbuf[1] & 0b11110000) << 4) | rxbuf[2]);
    tp=tp/10;
    float sp=(uint16_t) (((rxbuf[1] & 0b00001111) << 8) | rxbuf[3]);
    sp=sp/1000;
    
    if (rxbuf[0] & 0b00000001) { //todo silniki nie tylko 2 ale 8 max
        //sterowanie silnikiem B
        MoveContinuousB=0;
        if(autoCalcDir){
            float diff=currentPositionB-tp;
            dirB=diff>0?-1:1;
            if(abs(diff)>180.0)
                dirB*=-1;
        }else{
            dirB=(rxbuf[0] & 0b00001000)==0?-1:1;
        }
        SpeedB=sp;
        if (absf(tp-targetPositionB)>0.01){
            targetPositionB = tp;
            StartB=1;
        }
    } else {
        //sterowanie silnikiem A
        MoveContinuousA=0;
        if(autoCalcDir){
            float diff=currentPositionA-tp;
            dirA=diff>0?-1:1;
            if(abs(diff)>180.0)
                dirA*=-1;
        }else{
            dirA=(rxbuf[0] & 0b00001000)==0?-1:1;
        }
        SpeedA=sp;
        if (absf(tp-targetPositionA)>0.01){
            targetPositionA = tp;
            StartA=1;
        }
    }
}

void parseMotorMoveByAngle() {
    float tp=(uint16_t) (((rxbuf[1] & 0b11110000) << 4) | rxbuf[2]);
    tp=tp/10;    
    float sp=(uint16_t) (((rxbuf[1] & 0b00001111) << 8) | rxbuf[3]);
    sp=sp/1000;
    
    if (rxbuf[0] & 0b00000001) { //todo silniki nie tylko 2 ale 8 max
        //sterowanie silnikiem B
        MoveContinuousB=0;
        dirB=(rxbuf[0] & 0b00001000)==0?-1:1;
        if (dirB>0) {
            targetPositionB = checkAngle(electricalPositionB+tp);
        } else {
            targetPositionB = checkAngle(electricalPositionB-tp);
        }
        SpeedB=sp;
        StartB=1;
    } else {
        //sterowanie silnikiem A
        MoveContinuousA=0;        
        dirA=(rxbuf[0] & 0b00001000)==0?-1:1;
        if (dirA>0) {
            targetPositionA = checkAngle(electricalPositionA+tp);
        } else {
            targetPositionA = checkAngle(electricalPositionA-tp);
        }
        SpeedA=sp;
        StartA=1;
    }
}

void parseMotorMoveContinuous() {
    float sp=(uint16_t) (((rxbuf[1] & 0b00001111) << 8) | rxbuf[3]);

    if (rxbuf[0] & 0b00000001) { //todo silniki nie tylko 2 ale 8 max
        //sterowanie silnikiem B
        dirB=(rxbuf[0] & 0b00001000)==0?-1:1;
        SpeedB=sp/1000;
        StartB=1;
        MoveContinuousB=1;        
    } else {
        //sterowanie silnikiem A
        dirA=(rxbuf[0] & 0b00001000)==0?-1:1;
        SpeedA=sp/1000;
        StartA=1;
        MoveContinuousA=1;
    }
}

void parseMotorStop() {
    if (rxbuf[0] & 0b00000001) { //todo silniki nie tylko 2 ale 8 max
        //sterowanie silnikiem B
        MoveContinuousB=0;
        StartB=0;
        targetPositionB = currentPositionB;
    } else {
        MoveContinuousA=0;
        StartA=0;
        targetPositionA = currentPositionA;
    }
}

void parseMotorGetInfo() {
    uint8_t info = rxbuf[1];
   
    if (rxbuf[0] & 0b00000001) { //todo silniki nie tylko 2 ale 8 max
        if (info==0){
            SPI1BUFL = electricalPositionB*10;
            SPI1BUFH = 0;
        } else 
        if (info==1){
            SPI1BUFL = curTorqueB*10;
            SPI1BUFH = 0;
        } else 
        if (info==2){
            SPI1BUFL = lastMotionB;
            SPI1BUFH = 0;
        }
        if (info==3){
            uint16_t encVal=0;
            getEnc2Val(&encVal);
            SPI1BUFL = encVal;
            SPI1BUFH = 0;
        }
    } else {
        if (info==0){
            SPI1BUFL = electricalPositionA*10;
            SPI1BUFH = 0;
        } else 
        if (info==1){
            SPI1BUFL = curTorqueA*10;
            SPI1BUFH = 0;
        } else 
        if (info==2){
            SPI1BUFL = lastMotionA;
            SPI1BUFH = 0;
        }       
        if (info==3){
            uint16_t encVal=0;
            getEnc1Val(&encVal);
            SPI1BUFL = encVal;
            SPI1BUFH =0;
        }
    }
}


void parseMotorPolePairs() {
    if (rxbuf[0] & 0b00000001) { //todo silniki nie tylko 2 ale 8 max
        //sterowanie silnikiem B
        PolePairsB = (float) (rxbuf[1]);
    } else {
        PolePairsA = (float) (rxbuf[1]);
    }
}


void Delay(uint16_t cycles){
    uint16_t i;
    for (i=0; i<cycles; i++){
        asm("nop");
    } 
}

