SaraEye/SaraKIT-dsPIC33-bldc-gimbal-motor/main.c
void ACC_init() {    
    const uint8_t CTRL_REG1_ADDRESS = 0x20;
    const uint8_t CTRL_REG4_ADDRESS = 0x23;
//    const uint8_t CTRL_REG1_VAL = 0b10010111; //Normal mode 1.344kHz, axis X,Y,Z enabled
    const uint8_t CTRL_REG1_VAL = 0b01010111; //Normal mode 100Hz, axis X,Y,Z enabled
    const uint8_t CTRL_REG4_VAL = 0b00010000; //4g scale limit
     
    i2cBufferTX[0] = CTRL_REG1_ADDRESS; 
    i2cBufferTX[1] = CTRL_REG1_VAL;
    I2C1_MasterWrite((uint8_t*) i2cBufferTX, 2, ACC_I2C_ADDRESS, (I2C1_MESSAGE_STATUS*) & i2c_status);
    uint16_t w=0;
    while(i2c_status != I2C1_MESSAGE_COMPLETE && w<50000) w++;
    Delay(30000); 
    i2cBufferTX[0] = CTRL_REG4_ADDRESS; 
    i2cBufferTX[1] = CTRL_REG4_VAL;
    I2C1_MasterWrite((uint8_t*) i2cBufferTX, 2, ACC_I2C_ADDRESS, (I2C1_MESSAGE_STATUS*) & i2c_status);
    w=0;
    while(i2c_status != I2C1_MESSAGE_COMPLETE && w<50000) w++;
    Delay(30000); 
    
    accReadEnable = true;
}

// void SPI1_SendBuffer32bit(uint32_t *pTransmitBuffer, uint8_t buffSize) {
//    //wait until previous data will be sent
//    uint8_t dataSent = 0;
//    while (dataSent < buffSize) {
//        if (SPI1STATLbits.SPITBF != true) {
//            SPI1BUFL = 0xFFFF & pTransmitBuffer[dataSent];
//            SPI1BUFH = 0xFFFF & (pTransmitBuffer[dataSent] >> 16);
//            dataSent++;
//        }
//    }
// }

void readACCdata() {
    static uint8_t localBuffer[6];
//    static uint8_t mode=0;
//    if (mode == 0){
        //Inicjalizacja. Zapisz dane do bufora pomocniczego. Skopiuj pierwsze 4 bajty do bufora SPI
            IEC0bits.CCT1IE = 0;
            memcpy(localBuffer, (uint8_t*) accBuffer, sizeof (localBuffer));
            IEC0bits.CCT1IE = 1;
            SPI1BUFL = localBuffer[2] | (uint16_t)localBuffer[3]<<8;
            SPI1BUFH = localBuffer[4] | (uint16_t)localBuffer[5]<<8;
            if(SPI1BUFL==0&&SPI1BUFH==0&&accReadEnable){
                 ACC_init();
            }
/*            
            mode=1;
    } else if (mode == 1){
            SPI1BUFL = localBuffer[0] | (uint16_t)localBuffer[1]<<8;
            SPI1BUFH = localBuffer[2] | (uint16_t)localBuffer[3]<<8;
            mode=2;
    } else {
            SPI1BUFL = localBuffer[4] | (uint16_t)localBuffer[5]<<8;
            SPI1BUFH = 0;
            mode=0;
    }
*/    
}

int main(void)
{
    //Inicjalizacja peryferiow
    SYSTEM_Initialize();
    spiBufReset();
    //Wlaczenie kanalow wyjsiowych drivera A
    IO_RB7_SetHigh(); //EN1
    IO_RC5_SetHigh(); //EN2
    IO_RB5_SetHigh(); //EN3

    //Wlaczenie kanalow wyjsiowych drivera B
    IO_RB13_SetHigh(); //EN1
    IO_RB15_SetHigh(); //EN2
    IO_RB11_SetHigh(); //EN3

    //Uruchomienie driverow (wyjscie z resetu)
    IO_RA1_SetHigh(); //enable driver A
    IO_RA3_SetHigh(); //enable driver A

    //motor_table for 7 pole pair = 360/(360*7*5(0.2stopnia))=dok?adno?? 0.02857 stopnia
    uint16_t a02=0;
    for(float a=0; a<=361; a=a+0.2){
        motor_table[a02]=computeVoltageVector(a);
        a02++;
    }               
    
    //Inicjalizacja modulu PWM dopiero po skonfigurowaniu driverow                                                                     
    PWM_Initialize();

    //Inicjalizacja glownego przerwania programowego i uruchomienie sygnalow PWM
    TMR1_SetInterruptHandler(&timer_interrupt);
    TMR1_Start();
    PWM_Enable();
    
    SCCP1_TMR_Start();
    ACC_init();  
   
    TMR1_Period16BitSet(defaultTimerPeriod);
    //glowna petla programu interpretujaca dane odczytane po SPI (od RPI)
    while (1) {   
       // uint32_t encVal=getEnc2Val();
        if (newData) {
            //Wylacz przerwania na czas modyfikacji parametrow
            //IEC0bits.SPI1RXIE = false;
            //IEC0bits.T1IE = false;
            newData = false;
            uint8_t msgType = rxbuf[0] >> 4;


            switch (msgType) {
                case 0:
                    parseMotorMoveToAngle(false);
                    break;
                case 1:
                    parseMotorMoveToAngle(true);
                    break;
                case 2:
                    IEC0bits.SPI1RXIE = false;//to do - czy to potrzebne?
                    IEC0bits.T1IE = false;
                    parseMotorMoveByAngle();
                    IEC0bits.SPI1RXIE = true;
                    IEC0bits.T1IE = true;
                    break;

                case 3:
                    parseMotorMoveContinuous();
                    break;
                    
                case 4:
                    parseMotorMoveTorque();
                    break;
                    
                case 5:
                    parseMotorIdleTorque();
                    break;

                case 6: 
                    parseMotorStop();
                    break;

                case 7:
                    parseMotorGetInfo();
                    break;
                    
                case 8:
                    Reset();                    
                    break;
                    
                case 9:
                    readACCdata();
                    break;
                    
                case 10:
                    IEC0bits.SPI1RXIE = false;
                    IEC0bits.T1IE = false;
                    parseMotorTimerPeriod();
                    IEC0bits.SPI1RXIE = true;
                    IEC0bits.T1IE = true;                    
                    break;
                    
                case 11:
                    parseMotorPolePairs();
                    break;

                case 12:
                    break;

                case 13:
                    break;
           
                default:
                    break;
            }
            //Wlacz ponownie przerwania
            //IEC0bits.SPI1RXIE = true;
            //IEC0bits.T1IE = true;
        }
    }
    return -1;
}
/**
 End of File
*/
